MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMD10D14AU/mcu.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M0PLUS exception handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void SVCall_Handler                ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void PM_Handler                    ( void );
void SYSCTRL_Handler               ( void );
void WDT_Handler                   ( void );
void RTC_Handler                   ( void );
void EIC_Handler                   ( void );
void NVMCTRL_Handler               ( void );
void DMAC_Handler                  ( void );
void EVSYS_Handler                 ( void );
void SERCOM0_Handler               ( void );
void SERCOM1_Handler               ( void );
void SERCOM2_Handler               ( void );
void TCC0_Handler                  ( void );
void TC1_Handler                   ( void );
void TC2_Handler                   ( void );
void ADC_Handler                   ( void );
void AC_Handler                    ( void );
void DAC_Handler                   ( void );
void PTC_Handler                   ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* Configuration of the CORTEX-M0PLUS Processor and Core Peripherals */
#define __CM0PLUS_REV                 0x0001 /* Cortex-M0+ Core Revision                                                  */
#define __MPU_PRESENT                      0 /* MPU present or not                                                        */
#define __NVIC_PRIO_BITS                   2 /* Number of Bits used for Priority Levels                                   */
#define __VTOR_PRESENT                     1 /* Vector Table Offset Register present or not                               */
#define __Vendor_SysTickConfig             0 /* Set to 1 if different SysTick Config is used                              */
#define __ARCH_ARM                         1
#define __ARCH_ARM_CORTEX_M                1

/* CMSIS includes */
// Note: Changed for MikroE implementation.
// #include "core_cm0plus.h"
#if defined USE_CMSIS_INIT
// Note: Changed for MikroE implementation.
// #include "system_samd10.h"
#endif /* USE_CMSIS_INIT */

/* ************************************************************************** */
/*   SOFTWARE PERIPHERAL API DEFINITION FOR SAMD10D14AU                       */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adc.h"
#include "component/dac.h"
#include "component/dmac.h"
#include "component/dsu.h"
#include "component/eic.h"
#include "component/evsys.h"
#include "component/fuses.h"
#include "component/gclk.h"
#include "component/hmatrixb.h"
#include "component/mtb.h"
#include "component/nvmctrl.h"
#include "component/pac.h"
#include "component/pm.h"
#include "component/port.h"
#include "component/ptc.h"
#include "component/rtc.h"
#include "component/sercom.h"
#include "component/sysctrl.h"
#include "component/tc.h"
#include "component/tcc.h"
#include "component/wdt.h"

/* ************************************************************************** */
/*   INSTANCE DEFINITIONS FOR SAMD10D14AU */
/* ************************************************************************** */
#include "instance/ac.h"
#include "instance/adc.h"
#include "instance/dac.h"
#include "instance/dmac.h"
#include "instance/dsu.h"
#include "instance/eic.h"
#include "instance/evsys.h"
#include "instance/fuses.h"
#include "instance/gclk.h"
#include "instance/mtb.h"
#include "instance/nvmctrl.h"
#include "instance/pac0.h"
#include "instance/pac1.h"
#include "instance/pac2.h"
#include "instance/pm.h"
#include "instance/port.h"
#include "instance/ptc.h"
#include "instance/rtc.h"
#include "instance/sbmatrix.h"
#include "instance/sercom0.h"
#include "instance/sercom1.h"
#include "instance/sercom2.h"
#include "instance/sysctrl.h"
#include "instance/tc1.h"
#include "instance/tc2.h"
#include "instance/tcc0.h"
#include "instance/wdt.h"

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR SAMD10D14AU                                 */
/* ************************************************************************** */
#define ID_PAC0          (  0) /* Peripheral Access Controller (PAC0) */
#define ID_PM            (  1) /* Power Manager (PM) */
#define ID_SYSCTRL       (  2) /* System Control (SYSCTRL) */
#define ID_GCLK          (  3) /* Generic Clock Generator (GCLK) */
#define ID_WDT           (  4) /* Watchdog Timer (WDT) */
#define ID_RTC           (  5) /* Real-Time Counter (RTC) */
#define ID_EIC           (  6) /* External Interrupt Controller (EIC) */
#define ID_PAC1          ( 32) /* Peripheral Access Controller (PAC1) */
#define ID_DSU           ( 33) /* Device Service Unit (DSU) */
#define ID_NVMCTRL       ( 34) /* Non-Volatile Memory Controller (NVMCTRL) */
#define ID_PORT          ( 35) /* Port Module (PORT) */
#define ID_DMAC          ( 36) /* Direct Memory Access Controller (DMAC) */
#define ID_MTB           ( 38) /* Cortex-M0+ Micro-Trace Buffer (MTB) */
#define ID_SBMATRIX      ( 39) /* HSB Matrix (SBMATRIX) */
#define ID_PAC2          ( 64) /* Peripheral Access Controller (PAC2) */
#define ID_EVSYS         ( 65) /* Event System Interface (EVSYS) */
#define ID_SERCOM0       ( 66) /* Serial Communication Interface (SERCOM0) */
#define ID_SERCOM1       ( 67) /* Serial Communication Interface (SERCOM1) */
#define ID_SERCOM2       ( 68) /* Serial Communication Interface (SERCOM2) */
#define ID_TCC0          ( 69) /* Timer Counter Control (TCC0) */
#define ID_TC1           ( 70) /* Basic Timer Counter (TC1) */
#define ID_TC2           ( 71) /* Basic Timer Counter (TC2) */
#define ID_ADC           ( 72) /* Analog Digital Converter (ADC) */
#define ID_AC            ( 73) /* Analog Comparators (AC) */
#define ID_DAC           ( 74) /* Digital Analog Converter (DAC) */
#define ID_PTC           ( 75) /* Peripheral Touch Controller (PTC) */

#define ID_PERIPH_MAX    ( 75) /* Number of peripheral IDs */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR SAMD10D14AU                   */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x42002400)                 /* AC Registers Address         */
#define ADC_REGS                         ((adc_registers_t*)0x42002000)                /* ADC Registers Address        */
#define DAC_REGS                         ((dac_registers_t*)0x42002800)                /* DAC Registers Address        */
#define DMAC_REGS                        ((dmac_registers_t*)0x41004800)               /* DMAC Registers Address       */
#define DSU_REGS                         ((dsu_registers_t*)0x41002000)                /* DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x40001800)                /* EIC Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x42000400)              /* EVSYS Registers Address      */
#define GCLK_REGS                        ((gclk_registers_t*)0x40000c00)               /* GCLK Registers Address       */
#define SBMATRIX_REGS                    ((hmatrixb_registers_t*)0x41007000)           /* SBMATRIX Registers Address   */
#define MTB_REGS                         ((mtb_registers_t*)0x41006000)                /* MTB Registers Address        */
#define NVMCTRL_REGS                     ((nvmctrl_registers_t*)0x41004000)            /* NVMCTRL Registers Address    */
#define OTP4_FUSES_REGS                  ((fuses_otp4_fuses_registers_t*)0x00806020)   /* FUSES Registers Address      */
#define TEMP_LOG_FUSES_REGS              ((fuses_temp_log_fuses_registers_t*)0x00806030) /* FUSES Registers Address      */
#define USER_FUSES_REGS                  ((fuses_user_fuses_registers_t*)0x00804000)   /* FUSES Registers Address      */
#define PAC0_REGS                        ((pac_registers_t*)0x40000000)                /* PAC0 Registers Address       */
#define PAC1_REGS                        ((pac_registers_t*)0x41000000)                /* PAC1 Registers Address       */
#define PAC2_REGS                        ((pac_registers_t*)0x42000000)                /* PAC2 Registers Address       */
#define PM_REGS                          ((pm_registers_t*)0x40000400)                 /* PM Registers Address         */
#define PORT_REGS                        ((port_registers_t*)0x41004400)               /* PORT Registers Address       */
#define PORT_IOBUS_REGS                  ((port_registers_t*)0x60000000)               /* PORT Registers Address       */
#define PTC_REGS                         ((ptc_registers_t*)0x42002c00)                /* PTC Registers Address        */
#define RTC_REGS                         ((rtc_registers_t*)0x40001400)                /* RTC Registers Address        */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x42000800)             /* SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x42000c00)             /* SERCOM1 Registers Address    */
#define SERCOM2_REGS                     ((sercom_registers_t*)0x42001000)             /* SERCOM2 Registers Address    */
#define SYSCTRL_REGS                     ((sysctrl_registers_t*)0x40000800)            /* SYSCTRL Registers Address    */
#define TC1_REGS                         ((tc_registers_t*)0x42001800)                 /* TC1 Registers Address        */
#define TC2_REGS                         ((tc_registers_t*)0x42001c00)                 /* TC2 Registers Address        */
#define TCC0_REGS                        ((tcc_registers_t*)0x42001400)                /* TCC0 Registers Address       */
#define WDT_REGS                         ((wdt_registers_t*)0x40001000)                /* WDT Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR SAMD10D14AU                                 */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UINT32_(0x42002400)                          /* AC Base Address */
#define ADC_BASE_ADDRESS                 _UINT32_(0x42002000)                          /* ADC Base Address */
#define DAC_BASE_ADDRESS                 _UINT32_(0x42002800)                          /* DAC Base Address */
#define DMAC_BASE_ADDRESS                _UINT32_(0x41004800)                          /* DMAC Base Address */
#define DSU_BASE_ADDRESS                 _UINT32_(0x41002000)                          /* DSU Base Address */
#define EIC_BASE_ADDRESS                 _UINT32_(0x40001800)                          /* EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UINT32_(0x42000400)                          /* EVSYS Base Address */
#define GCLK_BASE_ADDRESS                _UINT32_(0x40000c00)                          /* GCLK Base Address */
#define SBMATRIX_BASE_ADDRESS            _UINT32_(0x41007000)                          /* SBMATRIX Base Address */
#define MTB_BASE_ADDRESS                 _UINT32_(0x41006000)                          /* MTB Base Address */
#define NVMCTRL_BASE_ADDRESS             _UINT32_(0x41004000)                          /* NVMCTRL Base Address */
#define OTP4_FUSES_BASE_ADDRESS          _UINT32_(0x00806020)                          /* FUSES Base Address */
#define TEMP_LOG_FUSES_BASE_ADDRESS      _UINT32_(0x00806030)                          /* FUSES Base Address */
#define USER_FUSES_BASE_ADDRESS          _UINT32_(0x00804000)                          /* FUSES Base Address */
#define PAC0_BASE_ADDRESS                _UINT32_(0x40000000)                          /* PAC0 Base Address */
#define PAC1_BASE_ADDRESS                _UINT32_(0x41000000)                          /* PAC1 Base Address */
#define PAC2_BASE_ADDRESS                _UINT32_(0x42000000)                          /* PAC2 Base Address */
#define PM_BASE_ADDRESS                  _UINT32_(0x40000400)                          /* PM Base Address */
#define PORT_BASE_ADDRESS                _UINT32_(0x41004400)                          /* PORT Base Address */
#define PORT_IOBUS_BASE_ADDRESS          _UINT32_(0x60000000)                          /* PORT Base Address */
#define PTC_BASE_ADDRESS                 _UINT32_(0x42002c00)                          /* PTC Base Address */
#define RTC_BASE_ADDRESS                 _UINT32_(0x40001400)                          /* RTC Base Address */
#define SERCOM0_BASE_ADDRESS             _UINT32_(0x42000800)                          /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UINT32_(0x42000c00)                          /* SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UINT32_(0x42001000)                          /* SERCOM2 Base Address */
#define SYSCTRL_BASE_ADDRESS             _UINT32_(0x40000800)                          /* SYSCTRL Base Address */
#define TC1_BASE_ADDRESS                 _UINT32_(0x42001800)                          /* TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UINT32_(0x42001c00)                          /* TC2 Base Address */
#define TCC0_BASE_ADDRESS                _UINT32_(0x42001400)                          /* TCC0 Base Address */
#define WDT_BASE_ADDRESS                 _UINT32_(0x40001000)                          /* WDT Base Address */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR SAMD10D14AU                                          */
/* ************************************************************************** */
// Note: Changed for MikroE implementation.
// #include "pio/samd10d14au.h"

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR SAMD10D14AU                               */
/* ************************************************************************** */
#define FLASH_SIZE                     _UINT32_(0x00004000)    /*   16kB Memory segment type: flash */
#define FLASH_PAGE_SIZE                _UINT32_(        64)
#define FLASH_NB_OF_PAGES              _UINT32_(       256)

#define CAL_SIZE                       _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define LOCKBIT_SIZE                   _UINT32_(0x00000004)    /*    0kB Memory segment type: fuses */
#define OTP1_SIZE                      _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP2_SIZE                      _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP4_SIZE                      _UINT32_(0x000000e0)    /*    0kB Memory segment type: fuses */
#define OTP4_PAGE_SIZE                 _UINT32_(        64)
#define OTP4_NB_OF_PAGES               _UINT32_(         3)

#define TEMP_LOG_SIZE                  _UINT32_(0x00000008)    /*    0kB Memory segment type: fuses */
#define USER_PAGE_SIZE                 _UINT32_(0x00000100)    /*    0kB Memory segment type: user_page */
#define USER_PAGE_PAGE_SIZE            _UINT32_(        64)
#define USER_PAGE_NB_OF_PAGES          _UINT32_(         4)

